/*   @..@ 
	 (\--/)
	(.>__<.)
	^^^  ^^^  */
function area_data() {

	var home_json = {
		data: [{
			city: '天津',
			data: ["首创城", " 河东融科瀚棠", " 天津全运村", " 中海八里臺", " 路劲太阳城", " 香缇花园", " 星河时代", " 中粮大道", " 东亚风尚国际", " 兆恒广场院外SOHO", " 湯臣津湾一品", " 社会山2014", " 松江置嘉公寓", " 红星国际广场", " 蘭园", " 中交樾公馆", " 正荣润璟湾", " 首创大河宸章", " 自在城", " 华润橡树湾橡墅", " 熙汇广场", " 融创中心", " 星河荣御", " 金泰丽湾", " 和泓四季恋城", " 正荣润璟湾", " 合景御华园", " 鲁能公馆", " 星河时代", " 中交樾公馆", " 亿利华彩城", " 凯德国贸", " 首创暖山", " 合景御华园", " 红星国际广场", " 融科伍杄島", " 成山公馆", " 天山城", " 恒大御景半岛", " 锦绣佳苑", " 海泰海港花园", " 英伦世家", " 吉宝沁风御庭", " 龙泽馨园", " 佳和雅庭", " 津沽首府", " 旗锦苑", " 瓏府壹号", " 复地湖滨广场", " 东疆国际", " 凤河孔雀城", " 澜海庄园", " 燕云小镇", " 万通新新逸墅", " 万科东海岸", " 玺岳", " 华远波士顿", " 保利金融街诺丁山", " 远洋五矿旷世新城", " 双威悦馨苑", " 欧铂城", " 海上国际城", " 泽天下", " 天房意境", " 保利罗兰公馆", " 保利罗兰公馆", " 天房美棠", " 阳光太阳城", " 惠灵顿国际社区", " 富力津门湖", " 城投熙和园", " 旭日豪庭", " 中浩智城", " 美克嘉美湾", " 枫水湾二期", " 海泰渤龙湾", " 佳宁苑", " 阅海名筑", " 城建福源花园", " 融创中央学府", " 红杉树", " 立达博雅苑", " 世茂英郡", " 海泰渤龙湾", " 颐湖庄园", " 京基嶺域", " 南湖红星国际广场", " 中海寰宇天下", " 世茂生态城", " 新华联世家", " 北大资源阅城", " 东丽湖万科城高层", " 信置荔城首府", " 津门熙湖", " 天物郁江溪岸", " 富豪新开门", " 格调绮园", " 復康路十一號", " 世茂新街坊", " 宝安江南城", " 帝达东谷国际", " 招商局网谷企业街区", " 海泰软件园SOHO", " 天津雅颂居", " 海河大观", " 鑫苑汤泉世家", " 天津富力中心", " 九策联都星城", " 荣域启程", " 米兰东湖湾", " 天津恒大帝景", " 巨福园公寓", " 贻成豪庭", " 万科东丽湖鹭湖", " 象博豪庭", " 远洋香奈", " 滨海智谛山", " 天房郦堂", " 北大资源阅府", " 旭辉澜郡", " 中建滨海壹号", " 吉宝澜岸铭郡", " 金地紫乐府", " 天房锦园", " 君悦花苑", " 紫韵枫尚", " 旺海公府", " 鸿坤原乡郡", " 盛运大厦", " 翡翠蓝湾", " 泽信金汇湾", " 正馨佳居", " 御景湾", " 恒大山水城", " 建投领海三期", " 大地12城", " 卓达太阳城", " 华城浩苑", " 米兰阳光", " 盛世豪庭二期", " 橄榄郡", " 住总尚清湾", " 天山御府", " 香墅里", " 龙顺御墅", " 福源天安佳园", " 天房天和园", " 宸峰家园", " 南园", " 宜禾红橡公园", " 世茂薇琅墅", " 中央公馆", " 世茂御龙湾", " 北辰红星国际广场", " 左右城", " 中山八号中山8克拉", " 保富国际", " 瑞奇青年汇", " 合生君景湾", " 东方文化广场", " 天津华侨城天鹅堡", " 天津碧桂园", " 南益名士华庭", " 泰悦豪庭", " 美震瑞景时代", " 宝安江南城", " 依水和墅", " 保利溪湖林语", " 金侨新梅江壹号", " 融创中央学府", " 新梅江雅境新枫尚", " 半湾半岛", " 首城南湖1號", " 首创国际半岛", " 中信城市广场", " 天房天辰世纪", " 荔隆观邸", " 花溪畔", " 天津大都会", " 金泰丽舍", " 国耀上河城", " 鸿瑞锦园", " 旭辉燕南园", " 御河墅", " 奕聪花园", " 绿洲湾8号", " 东丽湖万科城别墅", " 巨福园公寓", " 万城聚豪", " 华纳豪园3期", " 世茂御龙湾", " 阳光太阳城", " 哈兰庄园", " 建邦时代汇", " 鸿坤原乡半岛", " UPUP公寓", " 皇冠国际公寓", " 英伦假日", " 国兴融泰城", " 天骥筑璟", " 北辰新天地盛景湾", " 府上和平", " 观锦", " 联发第五街", " 融创君澜", " 水墨兰庭", " 钱隆学府", " 中冶德贤公馆", " 阿亚拉雅境", " 恒大名都", " 奥莱城", " 天房意墅", " 金地艺华年", " 保利香颂湖", " 贻海观澜", " 君利名筑", " 五矿榕园", " 海河原筑", " 经纬城市绿洲武清二期", " 南湖9号", " 雍鑫红星华府", " 紫盈花园", " 君悦府", " 天山龍玺", " 景瑞阳光尚城", " 泰达星海湾", " 松江东湖小镇", " 龙湾城", " 鑫谷园", " 润泽尚苑", " 天籁湾", " 卓达镜湖", " 天保美墅林", " 卓达三溪塘", " 天物轩宇嘉园", " 金侨宸公馆", " 天津恒大帝景", " 大成中环城", " 东西沽现房", " 锦润华庭", " 天津华侨城桥湾", " 王顶堤故里", " 泰达御景", " 五矿榕园", " 滨海明发广场", " 金领国际", " 天津东方环球影城", " 唐望府", " 世纪金三角公寓", " 公馆1882", " 富贾花园", " 水乡9号", " 南湖红星国际广场", " 中建幸福城", " 滨海浙商宜居", " 天安数码城", " 远洋心里", " 华润橡树湾", " 金地艺华年", " 泰安道五大院", " 万科金域华府", " 旭辉御府", " 贻成水木清华", " 米兰东湖湾", " 天津湾海景文苑", " 金隅悦城", " 鼎泰精装公寓", " 万科民和巷", " 天津诺德中心", " 天时茗苑", " 榕园嘉苑", " 锦尚豪庭", " 颐贤里", " 金侨大道", " 幸福公里", " 力高阳光海岸", " 京基嶺墅", " 城厢公馆", " 绅湖公馆", " 紫竹华庭", " 桃源观邸", " 南园", " 滨海湖", " 华润紫阳里", " 津澜阙", " 信恒锦园", " 公馆星期8", " 青朗园", " 克拉公馆", " 天安智慧港", " 拾光汇", " 滨海浙商宜居", " 保利梧桐语", " 远洋城", " 宝能城", " 天津华侨城天鹅堡", " 珺林", " 新梅江锦秀里", " 泰达城河与海", " 中国铁建国际城", " 翰澜苑", " 远雄兰苑", " 亚泰澜公馆", " 贝肯山", " 中海复兴九里", " 金筑家园", " 中信公园城", " 格调林泉", " 仁恒滨河湾", " 新汇华庭", " 万科金域国际", " 双发金玺城", " 尚港华府", " 渤海天易园", " 贻成峰景", " 理想城", " 房信彩虹城", " 和骏新家园", " 听海蓝珊", "林语花园"]
		}, {
			city: '北京',
			data: ["电建地产泷悦长安", "万柳书院", "盛德紫阙", "FCC中央城", "珺悦国际", "五矿铭品", "恒大领寓", "恒大华府", "五和万科长阳天地", "万科天地", "中铁花溪渡", "福景苑", "润泽御府", "梵悦108", "紫辰院", "远洋新天地", "铂铭郡", "天恒乐活城", "港中旅海泉湾", "金玉府", "丽都壹号", "宜山居", "首创紫悦台", "首尔甜城二期", "苹果汇", "公园懿府", "山水文园五期", "昆泰嘉瑞中心", "和成璟园", "金泰丽湾悦栖山", "亦庄金茂悦", "中冶蓝城", "丽景长安二期", "蓝光星华海悦城", "首创伊林郡", "中国铁建通瑞嘉苑", "龙冠冠华苑", "玺源台", "花雨汀", "中海枫丹公馆", "骏豪中央公园广场 阿玛尼城市公寓", "远洋春天著", "屯三里", "强佑清河新城", "五矿万科如园", "国瑞紫金台", "龙熙公馆", "园博府", "韩建青春誌", "TBD万科天地", "天佑爱上岛", "8哩岛", "城建上河湾", "紫晶七星广场", "嘉都", "金第梦想山", "香山四季", "霄云路8号", "合生摩尔公馆", "熙旺中心", "中昂时代广场", "君山高尔夫别墅", "汇金世界城", "新地国际家园", "新悦家园", "土桥plus", "中奥广场首站", "保利大都汇", "山水雅著", "欧逸水岸", "蓝爵公馆", "霞公府", "北京风景", "紫御华府", "泛海国际", "月亮河七星公馆", "中粮万科长阳半岛", "观筑御园", "新北京中心", "东亚印象台湖", "首城汇景湾", "西长安壹号", "东亚五环国际", "中国铁建广场", "空港国际", "东山condo", "励骏华庭", "天和嘉园", "腾龙家园三区", "恒华湖公馆", "使馆壹号院", "雲溪", "大宁山庄四区", "首开璞瑅墅", "首开璞瑅公馆", "中信墅", "广渠金茂府", "北京INN", "天恒世界集", "蜜码空间", "大苑海淀名著", "金宝城三期", "鸿坤花语墅", "紫贵御园", "万德福广场", "利锦府", "华业东方玫瑰", "上海建筑", "苏宁尊悦大厦", "金融街长安中心", "北京城建北京密码", "合生世界村", "鸿坤西山云景", "建邦华庭西区", "新贤家园", "长安太和", "中信国安府", "原香漫谷", "紫峰九院城", "长阳光和作用", "香江别墅II", "京基鹭府", "卡法国际", "正源尚峰尚水", "万嘉轩公寓", "东亚华欣湾", "富力尚悦居", "卢卡新天地", "中国铁建青秀尚城", "加拿大枫林园", "天润福熙大道", "红玺台", "北京城建世华龙樾", "首创天禧", "天润香墅湾1号", "北河沿甲柒拾柒号", "CBD东舍", "龙湖长城源著", "西山御园", "密云华润橡树湾", "合景领峰", "旭辉丽舍", "润泽公馆三期", "天安国汇", "北京城建上悦居", "保利首开四季怡园", "嘉禾天地", "中海金鑫阁", "金隅糖+", "中弘由山由谷", "汇福悦榕湾", "雲溪", "富力运河十号", "常楹公元自由派", "林肯公园二期", "新华联YOYO悦城", "远洋万和公馆", "水墨林溪", "K2海棠湾棠院", "一瓶四和院"]
		}, {
			city: '上海',
			data: ["金融街静安中心", "静安府", "国浩长风汇都", "万科翡翠名都", "绿洲康城亲水湾", "农房D9空间", "融创外滩188", "象屿上海年华", "万科公园大道", "国贸天悦佘山", "绿城兰园", "天居玲珑湾（别墅）", "禹洲老城里", "首创旭辉城", "富力虹桥十号（商住）", "万科安亭新镇", "一品国际", "朗诗未来街区", "信义嘉庭", "香溢花城", "融创外滩188（商住）", "三迪曼哈顿", "通用国际", "泰禾红御", "雅居乐星徽", "绿洲古猗新苑（二期）", "东方豪园", "城开珑庭", "棕榈滩海景城", "圣堡别墅", "宝山卓越时代广场", "绿洲雅宾利花园三期", "绿城黄浦湾", "合景万景峰", "南京西路公馆", "中福浦江汇", "紫竹半岛", "远香湖九号", "新城香溢都荟（商住）", "旭辉安贝尔花园", "瑞凯丽庭", "恒大御景湾", "金辉天鹅湾", "安高东方御府", "正荣国领（别墅）", "天和前滩时代", "骏丰玲珑坊", "禹洲商业广场（商住）", "恒大佘山首府", "同济东时区", "复地御西郊", "中粮南桥半岛", "御涛园", "西上海御庭（商住）", "中展瑞景", "文化名邸", "浦发罗兰翡丽", "吉宝季景铭郡", "路劲上海派", "水都南岸一期MOMA别墅", "珠江国际中心悦公馆", "名都古北", "富绅时代公馆", "上坤旭辉墅（别墅）", "汤臣臻园", "大名城名郡", "日月光伯爵公馆", "海珀黄浦", "华发四季", "大宁金茂府", "日月光中心伯爵居", "贝尚湾溪谷墅", "嘉宝梦之缘景庭", "君悦湾墅", "中鹰黑森林", "佳源名人公馆", "金臣汇", "虹桥融景别墅", "华侨城苏河湾（住宅）", "东郊紫园", "虹桥正荣府", "帕缇欧香苑", "尚海湾豪庭（二期）", "翡丽甲第", "华丽家族汇景天地", "中建大公馆", "中冶祥腾城市广场", "颐湾丽庭", "中环财富杰座", "星湖柒号（商住）", "安墁西郊", "凯迪赫菲庄园", "合景理想家", "新虹桥首府别墅", "市北祥腾麓源", "淮海名邸", "世茂佘山里（别墅）", "中铁逸都", "保利One56", "宛平88公寓", "万达茂公馆", "乐活天地四维尔时代广场", "尚浦名邸", "英庭名墅", "上海捷克住宅小区别墅", "华润佘山九里", "华山夏都苑", "嘉天汇御苑", "金域蔚蓝家园", "底特律财富天地", "绿地璀璨天城", "东门苑", "碧桂园嘉誉", "天和尚上海", "张江三湘海尚", "景瑞法兰云廷", "金臣别墅", "旭辉铂悦西郊", "紫菁庭", "智慧城", "合生广富汇（别墅）", "湖畔天下（别墅）", "东方鸿璟", "金地都会艺境", "御上海青橙", "九龙仓滨江壹十八", "星纪元", "复兴珑御", "大华西郊别墅", "海上湾", "万科南桥传奇", "蓝堡公馆", "金瀚园", "锦洋华园", "中信君廷", "古北萃庭公寓", "海韵茗庭", "保利蔚蓝林语", "绿舟星城", "同润菲诗艾伦", "南山雨果", "领航uptown", "尚汇豪庭", "臻水岸（别墅）", "中童巴比尼", "拙政别墅", "乔爱庄园", "绿岛江湾城", "上海院子", "南郊一品", "荣乐水岸", "夏都融庭", "摩登蜂巢", "佳兆业城市广场", "青浦卓越世纪中心", "万科海上传奇", "尼德兰花园二期", "金巢铂瑞阁", "盛大天地青春里2.0", "新虹桥首府", "首创禧悦", "中海悦府别墅", "世茂纳米魔幻城晶品公馆", "金地佘山天境", "露香园", "静安豪景", "凯德茂名公馆", "御龙首府", "君逸公馆", "同润十里洋坊", "正荣璟园", "仁恒东郊花园", "西郊半岛名苑", "金榜逸家", "红星国际广场（商住）", "同济东时区（别墅）", "佳源上海小城", "海滨新城（商住）", "申亚花涧墅", "百汇园", "璟储新和湾", "绿庭悦公馆", "堤亚纳昱墅", "万科云间传奇", "摩卡小城", "中金海棠湾", "盘古天地", "建发玖珑湾", "保利翡丽公馆", "东方冠郡", "蓝湖湾", "常发豪庭国际", "汇锦城（别墅）", "日月光伯爵天地", "汇锦城", "长宁88金廷", "丽都华庭", "鑫苑壹品世家", "东源名都", "大豪山林别墅", "安亭中央公园", "万科有山（别墅）", "信达蓝庭", "徐汇公园道壹号", "瑞虹新城怡庭", "悦尚华都", "怡水豪庭", "绿地海域观园", "绿地海珀风华", "绿地海珀佘山", "嘉隆国际广场", "莱蒙中央公寓", "百禄商业广场", "大华碧云天", "可逸兰亭", "亚通水岸景苑", "圣和静安公馆", "一品漫城五期", "大华锦绣华城", "阳光葡提公馆", "尚光徐汇中心", "佳源梦想广场", "光华糖果公元", "魔方社区", "水都南岸（商住）", "铂悦滨江（别墅）", "海上国际", "悦立方商业广场", "汇贤阁别墅", "建华铂中环（商住）", "紫都上海晶园", "绿地欧拉", "上海星河湾", "嘉御庭", "万城银座", "虹桥1号", "新城花屿湾", "华贸东滩花园", "红星紫郡", "同润金色橘苑", "万立城汽车公馆", "虹桥宝龙城", "凤凰景苑", "恒大帝景", "米兰诺贵都", "华府天地睿园", "盛世豪园（二期）", "象屿品城", "融创盛世滨江", "万科金域华府", "万科翡翠公园", "闻喜华庭", "浦东颐景园", "湖畔天下", "西上海君廷", "绿地芳满庭", "宏惠花苑二期", "新湖青蓝国际", "凯佳公寓", "溧阳公馆", "旭辉朗悦庭", "世茂佘山里", "凯德新视界", "万立城", "好世凤翔苑", "大华朗香花园", "世茂云图", "金地天地云墅", "华纺和成未来派", "金大元御珑宫廷（别墅）", "金地佘山天境（别墅）", "海伦堡爱ME城市", "中星红庐", "泷湾", "长泰西郊", "明中龙祥家园（别墅）", "佘山一品", "新弘墅园", "保亿风景水岸（别墅）", "华侨城十号院", "香水湾", "临港海滨国际花园（商住）", "江湾68公馆", "马德里洋房", "东海御庭", "建邦16区二期", "盛世香樟苑", "常发香城湾", "印象生活广场", "中环1号（三期）", "美诗邸", "中骏天誉别墅", "创融嘉天地", "悦天地", "梵克雅堡（商住）", "景源名墅（别墅）", "翠湖天地隽荟都", "海源别墅", "富悦财富广场", "中凯曼荼园", "华亭别墅", "万科云间传奇（别墅）", "罗森宝商务中心", "嘉宝梦之湾（别墅）", "御品园林", "恒海国际花园", "璟储新和湾（别墅）", "正荣御首府", "佘山珑原", "仁恒西郊花园", "滴水湖馨苑", "中铁北城时代", "龙湖锦宸公馆", "天居玲珑湾", "鑫塔水尚", "同润蓝美俊庭", "华润外滩九里", "八埭头公寓", "仁恒森兰雅苑", "中建公元壹号", "东渡青筑", "大学里", "上尚缘", "首创锦悦", "东亚威尼斯公馆", "荣信虹桥世嘉", "万业梦立方", "绿地东上海", "招商花园城公寓", "中国铁建青秀卓庭", "颐和泊雅轩", "临港海滨国际花园", "龙湖北城天街", "黄浦滩名苑", "金地自在城（二期）", "农房唐镇壹号", "陆家嘴锦绣前城", "滨江晶典二期", "经纬城市绿洲", "绿地海珀玉晖"]
		}, {
			city: '广州',
			data: ["嘉都汇", "翡翠城", "豪利幸福里", "信业尚誉", "金海御苑", "凤乐雅轩", "御江苑", "佳润云凯雅寓", "方圆·泉溪月岛", "万科欧泊", "琶洲壹號", "顺欣花园", "江山国际", "万科峯境", "天马河公馆", "顺丰翠园", "卓粤·卓雅名苑", "和记黄埔逸翠庄园", "珠光流溪御景", "隆泰逸品君庭", "水韵翔庭", "恒大银湖城", "帝景山庄", "翠荷轩", "南沙湾·东苑", "南沙金湾", "荔林春晓", "祈福活力花园2期", "中国铁建荔湾国际城", "保利天汇", "荔富湖畔", "保利南沙大都汇", "壹品E·Park", "雅居乐小院流溪", "东港花园", "祈福辉煌台·南岸", "西福蓝湾", "广东动漫城", "金湖翡翠山", "中海花湾壹号", "狮峰公馆", "君立M+World", "东华·星域", "水电广场", "利峰城", "万科金色梦想", "东馨美居", "荣御府", "南沙涉外公馆", "狮城国际", "越秀·御珑苑", "尚轩103", "兴业海逸半岛花园", "绿地·8克拉", "恒大金碧天下", "敏捷伊顿公馆", "名雅苑（永卓楼）", "景新豪苑", "云星·钱隆公馆", "南沙珠江湾", "珊瑚天峰", "恒大御府", "玖珑湖", "珠光御景壹號", "奶茶咖啡二期", "侨鑫汇悦台", "峻林", "西关海", "中惠国际金融中心", "保利大都汇", "天誉半岛花园", "溢盈湖畔别墅", "广州绿地中央广场", "科城山庄", "正太广场", "时代春树里", "时代外滩", "南沙湾·石奥", "新福港·鼎峰", "珠江帝景·紫龙府", "金马东湖壹号", "美悦湾", "万科·黄埔仓", "柏丽星寓", "智杰雅筑", "君御雅苑", "时尚广场", "保利公园九里", "天韵·瑚璟", "尚岛国际", "佛奥广场", "龙归城", "北部万科城", "荔山雅筑", "保利瓏熙", "锦林山庄", "尚品雅居", "珠江壹城", "学府南苑", "天健·上城", "龙光棕榈水岸", "碧桂园豪进广场", "雅居乐万科热橙", "泊雅湾", "亿城泉说", "中盈·一海里", "怡翠尊堤", "倾城国际", "锦东花园", "金马香颂居", "中海联·南沙国贸中心", "云峰花园四期", "雅宝新城", "精彩生活大厦", "新一城广场", "恒洲小苑", "大一山庄", "金凤皇庭", "海珠湖景峰", "流花君庭", "路劲隽悦豪庭", "宏康小筑", "广园东东方名都", "万科华府", "中大城", "富基广场", "南华时代城", "悠山时光", "悦江上品苑", "轩逸荟", "富力·壹號半岛", "颐德公馆", "保利天悦", "广州时代云图", "流溪半岛", "嘉华世家", "星尚", "方直芙蓉墅", "东山一品", "敏捷·金月湾", "中国铁建国际花园", "保利高尔夫郡", "时代南湾", "馨晴轩", "新城市·宜家", "小城大院", "中国美林湖", "南国公馆", "越秀星汇金沙二期别墅", "家和逸品苑", "迪亚春天", "碧桂园假日半岛", "汾水花园", "世泰凯旋公寓", "金沙御苑", "南航碧花园", "欣荣宏国际商贸城", "碧桂园·中新首府", "邦华·星际广场", "保利悦廷", "泊岸君庭", "越秀滨海悦城", "南沙万地雅涛阁", "倚绿山庄·尚院", "祈福天龙苑", "东湖映月", "龙津世家", "诺德名都", "CFD商汇", "海伦堡流金岁月", "翡翠绿洲", "紫薇丽都", "乐天峰公馆", "纵横国际公寓", "元邦明月水岸", "海力花园", "大壮国际广场", "万科峯汇", "锦绣半岛", "祈福名都", "欧亚公馆", "大岗绿庭雅苑", "深航御花园", "富凯星堤", "敏捷·锦绣星辰", "领江壹号", "科城山庄峻森园", "汇丽国际", "珠光御景山水城", "清水蓝湾", "博雅首府", "桃花源", "花城悦翠园", "汉中·紫薇苑", "邦华·星际II", "星力时代豪庭", "广物星港国际", "实地·常春藤", "广州亚运城", "中海誉城", "碧桂园·城市花园", "新时代家园", "金泽豪庭", "大学小筑", "锐丰中心", "印月·翠谷", "富丽居", "萝岗敏捷广场", "同创·滨江", "广州星河丹堤", "广州民间金融大厦", "保利云禧", "凯德·新玥", "捷登都会", "东风广场", "金地公园上城", "龙湖首开·天宸原著", "时代廊桥（增城）", "芙蓉春晓", "骏御华庭", "芙蓉春晓", "骏御华庭", "观园壹号", "优山悦海", "锦尚蓬莱苑", "君荟名轩", "广晟海韵星洲", "路劲隽泷湾", "晴海岸", "珠江东境花园", "领秀公馆", "人盛巴厘天地", "绿地·时代云都汇", "清远时代倾城", "侨建御溪谷", "农林华府", "合生骏景广场", "时代长岛（广州）", "恒大珺睿", "深业·江悦湾", "珑·翠", "友田碧云轩", "绿地·时代云都汇", "佳兆业·天御", "越秀晋德汇", "天河·新天地", "凯旋新世界", "东山上品", "碧桂园·轻轨悦城", "嘉裕公馆", "招商城市主场", "盈港国际", "敏捷·科创中心", "万科山景城", "增城·方圆云山诗意", "花都颐和山庄", "御金沙", "金融街·融穗澜湾", "方圆·越秀时光", "南沙城", "金融街·融穗华府", "紫泉流溪湾", "珠江鹅潭湾", "碧桂园凤凰城", "南沙翡翠公馆", "合景天峻", "罗马家园", "中泰天境", "中交港湾国际", "莱茵水岸", "珠江嘉园", "麓湖轩", "丽水蓝天", "越秀保利爱特城", "南沙裕豪轩", "珠光·山水御苑", "南沙塞纳河畔", "四海城", "越秀·可逸江畔", "新鸿基·御华园"]
		}, {
			city: '深圳',
			data: ["龙城中央", "中骏四季阳光", "壹方中心玖誉", "颐安都会中央二期", "新世界名镌", "同泰时代中心", "星都豪庭", "美地里园", "联美新天地", "万科广场·V寓", "前海凯御", "龙岐湾1号", "金地·1號院", "星河智荟", "龙岐湾1号", "天粹", "港铁天颂", "金众云山栖", "绿景虹湾", "华润城润府", "宝能公馆", "中熙君南山", "锦缘里", "合泰御景翠峰", "龙光·玖龙玺", "万科麓城三期", "鸿威de森林就瞰山", "华润深圳湾悦府", "佳兆业前海广场", "宁佳花园", "壹海城V公馆", "幸福珺湾", "梅沙1号", "博林天瑞", "深业泰然观澜玫瑰苑", "凯德公园1号", "荣德国际", "佳华领汇广场", "天福华府", "天琴湾", "森·尚璟", "鹏广达山海四季城", "君成雍和园", "中粮世家", "新锦安壹号公馆", "卓能雅苑", "前海湖山壹号", "佳兆业悦峰", "承翰半山海", "熙璟城", "澳城1618", "科技生态园", "华盛观荟", "中心天元", "德润荣君府", "宝生Midtown", "观澜湖", "壹锦园", "中海天钻", "宇宏健康花城", "汉森吉祥龙", "半山道1号礼宾府", "东海国际公寓", "天峦湖", "城建仁山智水花园", "满京华喜悦里", "山海四季花园", "智富特区", "佳兆业城市广场三期", "锦荟PARK", "曦湾天馥", "嘉亿·爵悦", "宝能城", "华海金湾公馆", "坤祥花语馨", "香格名苑", "麓园", "大族河山", "万科云城", "深业东岭", "奥宸观壹城", "儒骏城立方", "半岛城邦三期", "PURE 33 璞岸", "香山美墅", "深业上城", "恒大帝景", "卓越前海壹号", "汉京九榕台", "六和城", "华晖云门", "ONE39", "THE TOWN乐城", "汉金半山公馆", "保利悦都", "蓝郡广场", "深圳湾公馆", "恒地悦山湖花园", "珑门", "光明1号", "松河瑞园", "联投东方二期", "恒裕嘉城", "凯旋湾花园", "百合盛世二期", "汇峰轩", "仁恒峦山美地", "水湾1979", "山语清晖花园", "万科九龙山", "水云天雅苑", "星河WORLD银湖谷", "星河传奇", "华联·城市全景", "宏发前城", "万科公园6号", "前海铂寓", "中洲·中央公寓E-CLASS", "紫悦龙庭", "前海丹华", "华润银湖蓝山", "万泽云顶香蜜湖", "三科麓湾", "中环星苑", "金领假日公寓", "山语海", "佳兆业中心壹号", "卓越九珑", "盛意家园", "锦绣华天茗苑", "合正·丹郡", "龙平紫园", "大族云峰", "尚领公寓", "德弘天下华府", "莱蒙都会", "众冠时代广场", "豪方天际花园", "绿景红树湾壹号", "佳兆业山海城", "正展逸园", "绿景天玺湾项目", "向西雍睦豪庭", "帝景台", "长源村旧改", "泰华海逸世家", "招商三联旧改", "华苑", "荣超城市春天花园", "万科深南道68號", "御品峦山花园", "朗泓龙园大观"]
		}]
	}
	var xing = ["赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢", "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常", "乐", "于", "时", "傅", "皮", "卞", "齐", "康", "伍", "余"];
	var now_data = [];
	function day(obj) {
		if(!obj) {
			obj = 0;
		}
		var timestamp = new Date().getTime() + (obj * 24 * 60 * 60 * 1000);
		var n = new Date();
		var d = new Date(timestamp); //根据时间戳生成的时间对象
		var date = (d.getFullYear()) + "-" +
			(d.getMonth() + 1) + "-" +
			(d.getDate());
		return date;
	};
	var time_data=[day(),day(-1),day(-2)];
	for(var s = 0; s < 300; s++) {
		var data_json = {};
		var xing_ = Math.floor(xing.length * Math.random());
		var city_ = Math.floor(home_json.data.length * Math.random());
		var home_ = Math.floor(home_json.data[city_].data.length * Math.random());
		if(Math.random() > 0.5) {
			data_json.xing = xing[xing_] + '**'
		} else {
			data_json.xing = xing[xing_] + '*'
		}
		data_json.city = home_json.data[city_].city;
		data_json.home = home_json.data[city_].data[home_];
		data_json.areas = Math.floor(Math.random() * 130 + 70);
		data_json.money = Math.floor(data_json.areas*800/10000);
		if(s>55&&s<=105){
			data_json.time=time_data[2];
		}else if(s>105&&s<=205){
			data_json.time=time_data[1];
		}else{
			data_json.time=time_data[0];
		}
		now_data.push(data_json);
	}
//	console.log(JSON.stringFy{data:now_data})
	return {data:now_data};
};
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//